DigiTorus86/ESP32-R4ge-Pro/PlatformIO/esp32-r4ge-pro-gravitack/src/main.cpp
/***************************************************
ESP32 Badge - Gravitack game
An homage to the classic arcade console
by Paul Pagel

Requires:
 - ESP32 R4ge Pro

 Copyright (c) 2020 Paul Pagel
This is free software; see the license.txt file for more information.
There is no warranty; not even for merchantability or fitness for a particular purpose.
*****************************************************/

#include <Arduino.h>
#include "esp32_r4ge_pro.h" 
#include <XPT2046_Touchscreen.h>
#include "Levels.h"
#include "Bitmaps.h"
//#include "FireWav.h"
//#include "RefuelWav.h"
//#include "ExplosionWav.h"
//#include "WarpWav.h"
//#include "TickWav.h"

#define SHIP_SIZE    8
#define THRUST_SIZE  3 
#define SHOT_SPEED   8
#define MAX_SHOTS    4
#define MAX_GROUND  32
#define MAX_FUEL     8
#define MAX_TURRET   8
#define MAX_LIVES    6

#define PLAYER_FUEL_X 30
#define GAME_TOP   20 
#define FUEL_WD     8
#define FUEL_HT    16
#define INVALID_ITEM 999

enum game_state_type {
  STATE_TITLE,
  STATE_RULES,
  STATE_PLAYING,
  STATE_PAUSED,
  STATE_GAME_OVER
};

enum direction_type {
  DIR_UP = 1,
  DIR_DOWN = 2,
  DIR_LEFT = 3,
  DIR_RIGHT = 4
};

enum game_state_type game_state;

// constants used to speed up trig calculations
const double PId2  = PI / 2;
const double PId15 = PI / 1.5;
const double PIx15 = PI * 1.5;
const double PIx075 = PI * 0.75;

bool btn_was_pressed[8], btn_pressed[8], btn_released[8];
int16_t joy_x_left, joy_y_left, joy_x_right, joy_y_right; 

static int    player_start_x, player_start_y;
static double player_ctr_x = SCREEN_WD / 2;
static double player_ctr_y = SCREEN_HT / 4;
static double player_rotation = PIx15;
static double player_speed_x;
static double player_speed_y;
static double player_fuel;
static int    player_lives;
static long   player_score;
static long   next_ship = 10000;
static double gravity = 0.02;
static int    level;
static int    level_delay = 10;

int ship_x[9];
int ship_y[9];
int shot_x[MAX_SHOTS];
int shot_y[MAX_SHOTS];
int shot_range[MAX_SHOTS];
double shot_speed_x[MAX_SHOTS];
double shot_speed_y[MAX_SHOTS];
int player_shot_range; // # of game loops new shots can exist

int ground_x[MAX_GROUND];
int ground_y[MAX_GROUND];
int ground_size = 0;  // # of ground line segments in the current level

int  fuel_x[MAX_FUEL];
int  fuel_y[MAX_FUEL];
bool fuel_active[MAX_FUEL];
int  fuel_count;    // # starting fuel packs in level
int  fuel_remaining;  // # remaining fuel packs in level

int  turret_x[MAX_TURRET];
int  turret_y[MAX_TURRET];
int  turret_dir[MAX_TURRET];
bool turret_active[MAX_TURRET];
int  turret_shot_x[MAX_TURRET];
int  turret_shot_y[MAX_TURRET];
int  turret_shot_range[MAX_TURRET];
double turret_shot_speed_x[MAX_TURRET];
double turret_shot_speed_y[MAX_TURRET];
int  turret_range;    // # of game loops new turret shots can exist
int  turret_count;    // # starting turrets in level
int  turret_remaining;  // # remaining turrets in level

int turret_offset_x[4] = { 10, 10,-10, 20};
int turret_offset_y[4] = {-10, 10, 10, 10};

// Sound FX
// TODO!

Adafruit_ILI9341 tft = Adafruit_ILI9341(TFT_CS, TFT_DC, TFT_RST);

void drawTitleScreen();
void drawRulesScreen();
void startGame(int startLevel);
void drawPaused();
void erasePaused();
void drawGameOver();
void wipeGameArea();
void playShot();
void playFuelSound();
void drawExplosion(int x, int y, int maxRadius);
void initShots();
void loadLevelData(const int levelData[]);
void loadLevel(int lvl);
void drawGround();
void drawHeader();
void drawPlayerFuel();
void changePlayerFuel(int changeAmt);
void changePlayerScore(int changeAmt);
void drawPlayerLives();
void drawFuelPacks();
void drawFuelPack(int x, int y);
void eraseFuelPack(int x, int y);
void drawTurrets(int shotRate);
void drawTurret(int x, int y, int direction);
void eraseTurret(int x, int y, int direction);
void drawShip(int ctrX, int ctrY, double rotation, bool thrust);
void eraseShip();
void createPlayerShot(int x, int y, double rotation);
void movePlayerShots();
void movePlayerShot(int idx);
void createTurretShot(int x, int y);
bool moveTurretShots();
bool moveTurretShot(int idx);
bool hitsPlayer(int x, int y, double tolerance);
int  checkFuelHit(int x, int y, double tolerance);
bool hitsFuel(int idx, int x, int y, double tolerance);
int  checkTurretHit(int x, int y, double tolerance);
bool hitsTurret(int idx, int x, int y, double tolerance);
bool hitsGround(int x, int y, double tolerance);
bool hitsLine(int x, int y, int lineX1, int lineY1, int lineX2, int lineY2, double tolerance);
void startPlayer();
void killPlayer();
void advanceLevel();
void checkButtonPresses();
void checkJoysticks();
void handleTitle();
void handleRules();
void handlePlaying();
void handlePaused();
void handleGameOver();


/*
 *  Initialize hardware, peripherals, and libraries
 */
void setup() 
{
  Serial.begin(115200);
  Serial.println("ESP32 R4ge Pro - Gravitack"); 
  delay(100);

  pinMode(ESP_LED, OUTPUT);  // built-in blue LED on NodeMCU

  // Set up shift register pins
  pinMode(SR_PL, OUTPUT);
  pinMode(SR_CP, OUTPUT);   
  pinMode(SR_Q7, INPUT);

  // Set up the SPI CS output pins
  pinMode(TFT_CS, OUTPUT);
  pinMode(TCH_CS, OUTPUT);
  pinMode(SD_CS, OUTPUT);

  pinMode(TFT_LED, OUTPUT);
  digitalWrite(TFT_LED, LOW); // full brightness
  
  // Set up the joysticks
  pinMode(JOYX_L, INPUT);
  pinMode(JOYY_L, INPUT);
  pinMode(JOYX_R, INPUT);
  pinMode(JOYY_R, INPUT);

  delay(100);
  
  // Set up the TFT and touch screen
  tft.begin();
  tft.setRotation(SCREEN_ROT);

  drawTitleScreen();
}

/*
 * Draws the game title/splash screen
 */
void drawTitleScreen()
{
  tft.fillScreen(ILI9341_BLACK);

  tft.drawRGBBitmap(20, 60, (uint16_t *)gravitack_title, 279, 77);
  
  tft.setTextSize(2);
  tft.setTextColor(ILI9341_WHITE);
  tft.setCursor(40, 200);
  tft.print("[X] RULES, [Y] START");

  game_state = STATE_TITLE;
}

/*
 * Draws the game instructions screen
 */
void drawRulesScreen()
{
  tft.fillScreen(ILI9341_BLACK);
  
  tft.setTextSize(2);
  tft.setTextColor(ILI9341_WHITE);
  tft.setCursor(50, 0);
  tft.print("CONTROLS & SCORING");

  tft.drawLine(0, 25, 320, 25, ILI9341_GREEN);

  tft.setTextColor(ILI9341_DARKGREY);
  tft.setTextSize(2);
  tft.setCursor(10, 40);
  tft.print("Thrust: [A]");

  tft.setCursor(190, 40);
  tft.print("Pause: [X]");
  
  tft.setCursor(10, 60);
  tft.print("Fire:   [B]");
  
  
  tft.drawRect(24, 100, FUEL_WD, FUEL_HT, ILI9341_CYAN);
  
  tft.setCursor(50, 100);
  tft.print("200 pts");

  tft.setTextSize(1);
  tft.setCursor(160, 100);
  tft.print("Touch fuel packs with your");
  tft.setCursor(160, 110);
  tft.print("ship to pick them up");
  
  drawTurret(15, 140, 1);

  tft.setTextSize(2);
  tft.setCursor(50, 135);
  tft.print("500 pts"); 

  tft.setTextSize(1);
  tft.setCursor(160, 145);
  tft.print("Shoot all turrets");
  
  tft.setCursor(50, 165);
  tft.print("Pick up all fuel packs and destroy all");
  tft.setCursor(50, 175);
  tft.print("turrets to advance to the next level.");
  tft.setCursor(50, 190);
  tft.print("** Free ship every 10,000 points **");

  tft.drawLine(0, 210, 320, 210, ILI9341_GREEN);

