DigiTorus86/ESP32-R4ge-Pro/PlatformIO/esp32-r4ge-pro-gravitack/src/main.cpp
  tft.setTextColor(ILI9341_WHITE);
  tft.setTextSize(2);
  tft.setCursor(60, 220);
  tft.print("PRESS [Y] TO START");
  
  game_state = STATE_RULES;
}

/*
 * Initializes the game variables and draws the main gameplay screen
 */
void startGame(int startLevel)
{
  tft.fillScreen(ILI9341_BLACK);

  level = startLevel;
  player_score = 0;
  player_lives = 4;
  player_shot_range = 100;
  next_ship = 10000;
  turret_range = 10;

  loadLevel(level);
  drawHeader();
  drawGround();
  drawShip(player_ctr_x, player_ctr_y, player_rotation, false);

  game_state = STATE_PLAYING;
}

/*
 * Draws a Paused message on the screen
 */
void drawPaused()
{
  tft.fillRect(110, 20, 112, 20, ILI9341_BLACK);
  tft.setTextSize(1);
  tft.setTextColor(ILI9341_RED);
  tft.setCursor(110, 20);
  tft.print("** PAUSED **");
  delay(200);
  
  game_state = STATE_PAUSED;
}

/*
 * Erases the Paused message
 */
void erasePaused()
{
  tft.fillRect(110, 20, 112, 20, ILI9341_BLACK);
  delay(200);
  
  game_state = STATE_PLAYING;
}

/*
 * Draws the Game Over screen
 */
void drawGameOver()
{
  drawHeader();
  drawGround();
  tft.fillRect (80, 70, 160, 55, ILI9341_BLACK);  // clear msg area
  tft.drawRect (80, 70, 160, 55, ILI9341_YELLOW); // border
  
  tft.setTextSize(2);
  tft.setTextColor(ILI9341_WHITE);
  tft.setCursor(105, 80);
  tft.print("GAME OVER");

  tft.setTextSize(1);
  tft.setTextColor(ILI9341_WHITE);
  tft.setCursor(105, 110);
  tft.print("PRESS [Y] TO START");

  game_state = STATE_GAME_OVER;
}

void wipeGameArea()
{
  //DacAudio.Play(&warp_play);
  for (int i = 0; i <= 110; i++)
  {
    tft.drawRect(110 - i, 130 - i, i * 2 + 100, i * 2, ILI9341_WHITE);
    //DacAudio.FillBuffer(); 
  }
  //DacAudio.FillBuffer(); 
  for (int i = 0; i <= 110; i++)
  {
    tft.drawRect(110 - i, 130 - i, i * 2 + 100, i * 2, ILI9341_BLACK);
    //DacAudio.FillBuffer(); 
  }
}

/*
 * Plays the player shot sound
 */
void playShot()
{
  //DacAudio.Play(&fire_play);
}

/*
 * Draws and plays an explosion sound for a turret or the player ship
 */
void drawExplosion(int x, int y, int maxRadius)
{
  //DacAudio.Play(&explosion_play);
  for (int i = 1; i <= maxRadius; i++)
  {
    tft.drawCircle(x, y, i, ILI9341_YELLOW);
    //DacAudio.FillBuffer(); 
    delay(10);
  }
  for (int i = 1; i <= maxRadius; i++)
  {
    tft.drawCircle(x, y, i, ILI9341_BLACK);
    //DacAudio.FillBuffer(); 
    delay(10);
  }
}

/* 
 *  Plays the fuel pickup sound 
 */
void playFuelSound()
{
  //DacAudio.Play(&refuel_play);
}

/*
 * Initializes the player and turret shots to inactive
 */
void initShots()
{
  for (int i = 0; i < MAX_SHOTS; i++)
  {
    if (shot_range[i])  // erase old active shot
      tft.drawRect(shot_x[i], shot_y[i], 2, 2, ILI9341_BLACK);
    
    shot_range[i] = 0;
  }

  for (int i = 0; i < MAX_TURRET; i++)
  {
    if (turret_shot_range[i])  // erase old active turret shot
      tft.drawRect(turret_shot_x[i], turret_shot_y[i], 2, 2, ILI9341_BLACK);
    
    turret_shot_range[i] = 0;
  }
}

/*
 * Initializes game level (ground, fuel packs, turrets) from the level data parameter
 */
void loadLevelData(const int levelData[])
{
  // Load the ground segment data
  for (int i = 0; i < MAX_GROUND; i++)
   {
     if (levelData[i * 2] < 999)
     {
      ground_x[i] = levelData[i * 2];
      ground_y[i] = levelData[i * 2 + 1];
      ground_size = i;
     }
   }
   
   // Load the fuel pack location data
   int fuel_start = MAX_GROUND * 2;
   fuel_count = 0;
   
   for (int i = 0; i < MAX_FUEL; i++)
   {
     if (levelData[fuel_start + i * 2] < 999)
     {
      fuel_x[i] = levelData[fuel_start + i * 2];
      fuel_y[i] = levelData[fuel_start + i * 2 + 1];
      fuel_active[i] = true;
      fuel_count += 1;
     }
     else
     {
       fuel_active[i] = false;
     }
   }
   fuel_remaining = fuel_count;
  
   // Load the enemy turret location data
   int turret_start = fuel_start + MAX_FUEL * 2;
   turret_count = 0;
   
   for (int i = 0; i < MAX_TURRET; i++)
   {
     if (levelData[turret_start + i * 3] < 999)
     {
      turret_x[i] = levelData[turret_start + i * 3];
      turret_y[i] = levelData[turret_start + i * 3 + 1];
      turret_dir[i] = levelData[turret_start + i * 3 + 2];
      turret_active[i] = true;
      turret_count += 1;
     }
     else
     {
       turret_active[i] = false;
     }
   }
   turret_remaining = turret_count;
   
   // Load the miscellanous player/level data
   int misc_start = turret_start + MAX_TURRET * 3;
   
   player_start_x = levelData[misc_start];
   player_start_y = levelData[misc_start + 1];
   level_delay = levelData[misc_start + 2];
   
   startPlayer();
}

/*
 * Initializes game level (ground, fuel packs, turrets) based on the level parameter
 */
void loadLevel(int lvl)
{
  int level_map = lvl;
  while (level_map > MAX_LEVEL)
  {
    level_map -= MAX_LEVEL;
  }
  
  switch(level_map)
  {
  case 1: loadLevelData((int *)Level_01);
    break;
  case 2: loadLevelData((int *)Level_02);
    break;
  case 3: loadLevelData((int *)Level_03);
    break;
  case 4: loadLevelData((int *)Level_04);
    break;
  case 5: loadLevelData((int *)Level_05);
    break;
  case 6: loadLevelData((int *)Level_06);
    break;
  default:  loadLevelData((int *)Level_01);
  }
  
  tft.fillRect(0, 10, 320, 240, ILI9341_BLACK);
}

/*
 * Draws the ground segments for the current level
 */
void drawGround()
{
  for (int i = 0; i < ground_size; i++)
  {
  if (ground_x[i] < INVALID_ITEM && ground_x[i+1] < INVALID_ITEM)
  {
    tft.drawLine(ground_x[i], ground_y[i], ground_x[i+1], ground_y[i+1], ILI9341_GREEN);
  }
  }
}

/*
 * Draws the game header at the top of the screen (fuel, lives, score)
 */
void drawHeader()
{
  tft.setTextSize(1);
  tft.setTextColor(ILI9341_WHITE);
  
  tft.setCursor(0, 1);
  tft.print("FUEL");
  drawPlayerFuel();

  drawPlayerLives();

  tft.setCursor(240, 0);
  tft.print("SCORE: 000000");
  changePlayerScore(0);  
}

/*
 * Draws the player fuel bar
 */
void drawPlayerFuel()
{
  tft.drawRect(PLAYER_FUEL_X - 1, 0, 103, 10, ILI9341_WHITE);
  tft.fillRect(PLAYER_FUEL_X, 1, player_fuel, 8, ILI9341_CYAN);
}

