DigiTorus86/ESP32-R4ge-Pro/PlatformIO/esp32-r4ge-pro-gravitack/src/main.cpp
/*
 * Changes the player fuel by the given amount and redraws the fuel bar in the game header
 */
void changePlayerFuel(int changeAmt)
{
  if (changeAmt < 0)
  {
    tft.fillRect(PLAYER_FUEL_X + player_fuel, 1, changeAmt, 8, ILI9341_BLACK); 
    player_fuel += changeAmt;
    return;
  }

  // avoid going over fuel limit
  int chg = changeAmt;
  if (chg + player_fuel > 100)
    chg = 100 - player_fuel;

  tft.fillRect(PLAYER_FUEL_X + player_fuel, 1, chg, 8, ILI9341_CYAN); 
  player_fuel += chg;
  return;
}

/*
 * Changes and displays the player score and awards any free ships
 */
void changePlayerScore(int changeAmt)
{
  player_score += changeAmt;

  tft.fillRect(280,0, 40, 10, ILI9341_BLACK); // erase prev score
  tft.setTextColor(ILI9341_WHITE);
  tft.setCursor(280, 0);
  tft.print(player_score);
  
  if (changeAmt > 0 && player_score >= next_ship)
  {
    player_lives += 1;
    next_ship += 10000;
    drawPlayerLives();
  }
}

/*
 * Draws the player lives remaining in the game header
 */
void drawPlayerLives()
{
    int ctr_x, ctr_y;
    int x[5], y[5];
    
    for (int i = 0; i < MAX_LIVES; i++)
    {
      if (i < player_lives)
      {
        ctr_x = 150 + i * 16;
        ctr_y = 9;
        
        // nose of ship
        x[0] = ctr_x + cos(PIx15) * SHIP_SIZE;
        y[0] = ctr_y + sin(PIx15) * SHIP_SIZE;
        // left wingtip
        x[1] = ctr_x + cos(PIx15 - PId15) * SHIP_SIZE;
        y[1] = ctr_y + sin(PIx15 - PId15) * SHIP_SIZE;
        //center point
        x[2] = ctr_x;
        y[2] = ctr_y;
        // right wingtip
        x[3] = ctr_x + cos(PIx15 + PId15) * SHIP_SIZE;
        y[3] = ctr_y + sin(PIx15 + PId15) * SHIP_SIZE;
        // nose of ship
        x[4] = x[0];
        y[4] = y[0];
  
        // connect ship vertices
        for(int i = 0; i < 4; i++)
        {
          tft.drawLine(x[i], y[i], x[i+1], y[i+1], ILI9341_BLUE);
        }
      }
      else
      {
        // blank out ship space
        tft.fillRect(ctr_x - SHIP_SIZE, 0, 16, 16, ILI9341_BLACK);
      }
    }
}

/*
 * Draws the fuel packs on the game screen
 */
void drawFuelPacks()
{
  for (int i = 0; i < fuel_count; i++)
  {
    if (fuel_active[i])
    {
      drawFuelPack(fuel_x[i], fuel_y[i]);
    }
  }
}

/*
 * Draws a fuel pack at the given x,y coordinate (top left corner)
 */
void drawFuelPack(int x, int y)
{
  tft.drawRect(x, y, FUEL_WD, FUEL_HT, ILI9341_CYAN);
}

/*
 * Erases a fuel pack at the given x,y coordinate (top left corner)
 */
void eraseFuelPack(int x, int y)
{
  tft.drawRect(x, y, FUEL_WD, FUEL_HT, ILI9341_BLACK);
}

/*
 * Draws all turrets and randomly shoots at the player based on the shotRate
 */
void drawTurrets(int shotRate)
{
  int x, y;
  
  for (int i = 0; i < turret_count; i++)
  {
    if (turret_active[i])
    {
      drawTurret(turret_x[i], turret_y[i], turret_dir[i]);
      
      if (shotRate > random(100))
      {
        // try to shoot (from tip of turret)
        x = turret_x[i] + turret_offset_x[turret_dir[i] - 1];
        y = turret_y[i] + turret_offset_y[turret_dir[i] - 1];
        createTurretShot(x, y);
      }
    }
  }
}

/*
 * Draws a turret at the given x,y coordinates
 */
void drawTurret(int x, int y, int direction)
{
  switch(direction)
  {
  case DIR_UP: 
    tft.drawRect(x, y, 20, 10, ILI9341_RED);
    tft.drawRect(x + 5, y - 10, 10, 10, ILI9341_RED);
    break;
  case DIR_DOWN:
    tft.drawRect(x, y, 20, 10, ILI9341_RED);
    tft.drawRect(x + 5, y + 10, 10, 10, ILI9341_RED);
    break;
  case DIR_LEFT:
    tft.drawRect(x, y, 10, 20, ILI9341_RED);
    tft.drawRect(x - 10, y + 5, 10, 10, ILI9341_RED);
    break;
  case DIR_RIGHT:
    tft.drawRect(x, y, 10, 20, ILI9341_RED);
    tft.drawRect(x + 10, y + 5, 10, 10, ILI9341_RED);
    break;
  default:
    tft.drawRect(x, y, 20, 20, ILI9341_RED); // headless
  }
}

/*
 * Erases a turret at the given x,y coordinates
 */
void eraseTurret(int x, int y, int direction)
{
  switch(direction)
  {
  case DIR_UP: 
    tft.drawRect(x, y, 20, 10, ILI9341_BLACK);
    tft.drawRect(x + 5, y - 10, 10, 10, ILI9341_BLACK);
    break;
  case DIR_DOWN:
    tft.drawRect(x, y, 20, 10, ILI9341_BLACK);
    tft.drawRect(x + 5, y + 10, 10, 10, ILI9341_BLACK);
    break;
  case DIR_LEFT:
    tft.drawRect(x, y, 10, 20, ILI9341_BLACK);
    tft.drawRect(x - 10, y + 5, 10, 10, ILI9341_BLACK);
    break;
  case DIR_RIGHT:
    tft.drawRect(x, y, 10, 20, ILI9341_BLACK);
    tft.drawRect(x + 10, y + 5, 10, 10, ILI9341_BLACK);
    break;
  default:
    tft.drawRect(x, y, 20, 20, ILI9341_BLACK); // headless
  }
}

/*
 * Draws the player ship at the given x,y coordinates with the specified rotation and optional thrust flame
 */
void drawShip(int ctrX, int ctrY, double rotation, bool thrust)
{
    // nose of ship
    ship_x[0] = ctrX + cos(rotation) * SHIP_SIZE;
    ship_y[0] = ctrY + sin(rotation) * SHIP_SIZE;
    // left wingtip
    ship_x[1] = ctrX + cos(rotation - PId15) * SHIP_SIZE;
    ship_y[1] = ctrY + sin(rotation - PId15) * SHIP_SIZE;
    //center point
    ship_x[2] = ctrX;
    ship_y[2] = ctrY;
    // right wingtip
    ship_x[3] = ctrX + cos(rotation + PId15) * SHIP_SIZE;
    ship_y[3] = ctrY + sin(rotation + PId15) * SHIP_SIZE;
    // nose of ship
    ship_x[4] = ship_x[0];
    ship_y[4] = ship_y[0];

    // connect ship vertices
    for(int i = 0; i < 4; i++)
    {
      tft.drawLine(ship_x[i], ship_y[i], ship_x[i+1], ship_y[i+1], ILI9341_BLUE);
    }

    if (thrust)
    {
      // left thrust edge
      ship_x[5] = ctrX + cos(rotation - PId15) * THRUST_SIZE;
      ship_y[5] = ctrY + sin(rotation - PId15) * THRUST_SIZE;
      // thrust back tip
      ship_x[6] = ctrX + cos(rotation - PI) * SHIP_SIZE;
      ship_y[6] = ctrY + sin(rotation - PI) * SHIP_SIZE;
      // right thrust edge
      ship_x[7] = ctrX + cos(rotation + PId15) * THRUST_SIZE;
      ship_y[7] = ctrY + sin(rotation + PId15) * THRUST_SIZE;
      // center point
      ship_x[8] = ctrX;
      ship_y[8] = ctrY;

      // connect thrust vertices
      for(int i = 5; i < 8; i++)
      {
        tft.drawLine(ship_x[i], ship_y[i], ship_x[i+1], ship_y[i+1], ILI9341_RED);
      }
    }
    else  // not thrusting, reset exhaust flame
    {
      for(int i = 5; i < 9; i++)
      {
        ship_x[i] = ctrX;
        ship_y[i] = ctrY;
      }
    }    
}

