DigiTorus86/ESP32-R4ge-Pro/PlatformIO/esp32-r4ge-pro-gravitack/src/main.cpp
/*
 * Erases the player ship at the given x,y coordinates
 */
void eraseShip()
{
  for(int i = 0; i < 8; i++)
  {
    tft.drawLine(ship_x[i], ship_y[i], ship_x[i+1], ship_y[i+1], ILI9341_BLACK);
  }
}

/*
 * Creates a new player shot from the given x,y coordinates moving in the specified rotation direction
 */
void createPlayerShot(int x, int y, double rotation)
{
  for (int i = 0; i < MAX_SHOTS; i++)
  {
    if (shot_range[i] <= 0)
    {
      shot_x[i] = x;
      shot_y[i] = y;
      shot_range[i] = player_shot_range;
      shot_speed_x[i] = sin(rotation + PId2) * SHOT_SPEED;
      shot_speed_y[i] = -cos(rotation + PId2) * SHOT_SPEED;
      playShot();
      return;
    }
  }
}

/*
 * Moves all the player shots along their current paths
 */
void movePlayerShots()
{
  for (int i = 0; i < MAX_SHOTS; i++)
  {
    if (shot_range[i])
    {
      movePlayerShot(i);
    }
  }
}

/*
 * Moves a specific player shot along its current path and checks for collisions
 */
void movePlayerShot(int idx)
{
  // erase shot
  tft.drawRect(shot_x[idx], shot_y[idx], 2, 2, ILI9341_BLACK);
  
  shot_x[idx] += shot_speed_x[idx];
  shot_y[idx] += shot_speed_y[idx];

  if (shot_x[idx] < 10 || shot_x[idx] > 330 || 
      shot_y[idx] < 20 || shot_y[idx] > 230)
  {
     shot_range[idx] = 0;
     return;
  }

  if (checkTurretHit(shot_x[idx], shot_y[idx], 2) >= 0)
  {
    // hit a turret
    changePlayerScore(500);
    turret_remaining -= 1;
    shot_range[idx] = 0;
    return;
  }

  if (hitsGround(shot_x[idx], shot_y[idx], 5))
  {
    shot_range[idx] = 0;
    return;
  }

  // draw shot
  tft.drawRect(shot_x[idx], shot_y[idx], 2, 2, ILI9341_WHITE);
  shot_range[idx] -= 1;
}

/*
 * Creates a turret shot from the given x,y coordinates towards the player
 */
void createTurretShot(int x, int y)
{
  // introduce some targeting variability
  int rand_x = 16 - random(32);  
  int rand_y = 16 - random(32);

  // compute the angle and speed to the player ship
  double angle = atan2(player_ctr_y - y + rand_y, player_ctr_x - x + rand_x);
  double speed_x = sin(angle + PId2) * (SHOT_SPEED - 2);
  double speed_y = -cos(angle + PId2) * (SHOT_SPEED - 2);

  // find an inactive shot to use
  for (int i = 0; i < MAX_TURRET; i++)
  {
    if (turret_shot_range[i] <= 0)
    {
      turret_shot_x[i] = x;
      turret_shot_y[i] = y;
      turret_shot_range[i] = turret_range;

      turret_shot_speed_x[i] = speed_x;
      turret_shot_speed_y[i] = speed_y;
      playShot();
      return;
    }
  }
}

/*
 * Moves all the turret shots
 * Returns true if a shot hit the player
 */
bool moveTurretShots()
{
  bool hitPlayer;
  for (int i = 0; i < MAX_TURRET; i++)
  {
    if (turret_shot_range[i] > 0)
    {
      hitPlayer = moveTurretShot(i);
      if (hitPlayer)
        return true;
    }
  }
  return false;
}

/*
 * Moves a specific turret shot
 * Returns true if the shot hit the player
 */
bool moveTurretShot(int idx)
{
  // erase shot
  tft.drawRect(turret_shot_x[idx], turret_shot_y[idx], 2, 2, ILI9341_BLACK);
  
  turret_shot_x[idx] += turret_shot_speed_x[idx];
  turret_shot_y[idx] += turret_shot_speed_y[idx];

  if (turret_shot_x[idx] < 10 || turret_shot_x[idx] > 330 || 
      turret_shot_y[idx] < 20 || turret_shot_y[idx] > 230)
  {
     turret_shot_range[idx] = 0;
     return false;
  }

  if (hitsPlayer(turret_shot_x[idx], turret_shot_y[idx], SHIP_SIZE))
  {
    turret_shot_range[idx] = 0;
    killPlayer();
    return true;
  }

  if (hitsGround(turret_shot_x[idx], turret_shot_y[idx], 5))
  {
     turret_shot_range[idx] = 0;
     return false;
  }

  turret_shot_range[idx] -= 1;
  if (turret_shot_range[idx] > 0)
    tft.drawRect(turret_shot_x[idx], turret_shot_y[idx], 2, 2, ILI9341_RED);
  return false;
}

/*
 * Returns true if the given x,y coordinate hits the player ship within the specified tolerance
 */
bool hitsPlayer(int x, int y, double tolerance)
{
  return (abs(x - player_ctr_x) < tolerance && abs(y - player_ctr_y) < tolerance);

}

/*
 * Returns the a fuel index if the given x,y coordinate hits any fuel packs within the specified tolerance
 * Returns -1 if no fuel is at that coordinate
 */
int checkFuelHit(int x, int y, double tolerance)
{
  for (int i = 0; i < fuel_count; i++)
  {
    if (fuel_active[i])
    {
      if (hitsFuel(i, x, y, tolerance))
      {
        playFuelSound();
        eraseFuelPack(fuel_x[i], fuel_y[i]);
        fuel_active[i] = false;
        return i;
      }
    }
  }
  return -1;  // nothing hit
}

/*
 * Returns true if the given x,y coordinate hits a particular fuel pack within the specified tolerance
 */
bool hitsFuel(int idx, int x, int y, double tolerance)
{
  if (x >= fuel_x[idx] - tolerance && x <= fuel_x[idx] + FUEL_WD + tolerance &&  
      y >= fuel_y[idx] - tolerance && y <= fuel_y[idx] + FUEL_HT + tolerance)
  {
    return true; 
  }

  return false;
}

/*
 * Returns the turret index if the given coordinate hits any turret within the specified tolerance
 * Returns -1 if no turret is at that coordinate
 */
int checkTurretHit(int x, int y, double tolerance)
{
  for (int i = 0; i < turret_count; i++)
  {
    if (turret_active[i])
    {
      if (hitsTurret(i, x, y, tolerance))
      {
        drawExplosion(turret_x[i] + 10, turret_y[i], 12);
        eraseTurret(turret_x[i], turret_y[i], turret_dir[i]);
        turret_active[i] = false;
        return i;
      }
    }
  }
  return -1;  // nothing hit
}

/*
 * Returns true if the given x,y coordinate hits a particular turret within the specified tolerance
 */
bool hitsTurret(int idx, int x, int y, double tolerance)
{
  switch(turret_dir[idx])
  {
    case DIR_UP: 
      //tft.drawRect(x, y, 20, 10, ILI9341_RED);
      //tft.drawRect(x + 5, y - 10, 10, 10, ILI9341_RED);
      if (x >= turret_x[idx] && x <= turret_x[idx] + 20 &&  
        y >= turret_y[idx] && y <= turret_y[idx] + 10)
        return true;
      if (x >= turret_x[idx] +  5 && x <= turret_x[idx] + 15 &&  
        y >= turret_y[idx] - 10 && y <= turret_y[idx])
        return true;
      break;
    case DIR_DOWN:
      //tft.drawRect(x, y, 20, 10, ILI9341_RED);
      //tft.drawRect(x + 5, y + 10, 10, 10, ILI9341_RED);
      if (x >= turret_x[idx] && x <= turret_x[idx] + 20 &&  
        y >= turret_y[idx] && y <= turret_y[idx] + 10)
        return true;
      if (x >= turret_x[idx] +  5 && x <= turret_x[idx] + 15 &&  
        y >= turret_y[idx] && y <= turret_y[idx] + 10)
        return true;
      break;
    case DIR_LEFT:
      //tft.drawRect(x, y, 10, 20, ILI9341_RED);
      //tft.drawRect(x - 10, y + 5, 10, 10, ILI9341_RED);
      if (x >= turret_x[idx] && x <= turret_x[idx] + 10 &&  
        y >= turret_y[idx] && y <= turret_y[idx] + 20)
        return true;
      if (x >= turret_x[idx] - 10 && x <= turret_x[idx] &&  
        y >= turret_y[idx] + 5 && y <= turret_y[idx] + 15)
        return true;
      break;
    case DIR_RIGHT:
      //tft.drawRect(x, y, 10, 20, ILI9341_RED);
      //tft.drawRect(x + 10, y + 5, 10, 10, ILI9341_RED);
      if (x >= turret_x[idx] && x <= turret_x[idx] + 10 &&  
        y >= turret_y[idx] && y <= turret_y[idx] + 20)
        return true;
      if (x >= turret_x[idx] + 10 && x <= turret_x[idx] + 20 &&  
        y >= turret_y[idx] + 5 && y <= turret_y[idx] + 15)
        return true;
      break;
    default:
      return false;
  }

