DigiTorus86/ESP32-R4ge-Pro/PlatformIO/esp32-r4ge-pro-gravitack/src/main.cpp
  return false;
}

/*
 * Returns true if the given x,y coordinate hits any ground segment within the specified tolerance
 */
bool hitsGround(int x, int y, double tolerance)
{
  for (int i = 0; i < ground_size; i++)
  {
  if (ground_x[i] < INVALID_ITEM && ground_x[i+1] < INVALID_ITEM)
  {
    if (hitsLine(x, y, ground_x[i], ground_y[i], ground_x[i+1], ground_y[i+1], tolerance))
    {
    // debug option to flash ground segment when hit is detected
      //tft.drawLine(ground_x[i], ground_y[i], ground_x[i+1], ground_y[i+1], ILI9341_WHITE);
      //delay(200);
      //tft.drawLine(ground_x[i], ground_y[i], ground_x[i+1], ground_y[i+1], ILI9341_GREEN);
      return true;
    }
  }
  }
  return false;
}

/*
 * Returns true if the give x,y coordinate is on the line with endpoints X1,Y1 and X2,Y2 within the specified tolerance
 */
bool hitsLine(int x, int y, int lineX1, int lineY1, int lineX2, int lineY2, double tolerance)
{
  bool result = false;

  // quick bounding box check
  if (x < min(lineX1, lineX2) - tolerance || 
      x > max(lineX1, lineX2) + tolerance ||
      y < min(lineY1, lineY2) - tolerance || 
      y > max(lineY1, lineY2) + tolerance)
  {
    return false;       
  }
  
  // do actual linear equation check: y = mx + b
  // TODO: precompute slope (m) and x-intercept (b) for speed
  int  m_rise = lineY2 - lineY1; 
  int  m_run  = lineX2 - lineX1;
  double m_slope = 0;
  double b = 0;
  
  if (m_run > 0)
  {
    m_slope = m_rise / m_run;
    b = lineY1 - (m_slope * lineX1);
    if (abs(y - (m_slope * x) - b) < tolerance)
      result = true; 
  }
  else // we have a vertical line here
  {
    if (x == lineX1 && y <= max(lineY1, lineY2) && y >= min(lineY1, lineY2))
      result = true;
  }

  return result;
}

/*
 * Initialize the player ship
 */
void startPlayer()
{
  initShots();
  player_ctr_x = player_start_x; 
  player_ctr_y = player_start_y;
  player_speed_x = 0;
  player_speed_y = 0;
  player_rotation = PIx15; // up
  player_fuel = 100;
  delay(200);
  drawPlayerFuel();
  drawPlayerLives();
}

/*
 * Destroys the player's ship
 */
void killPlayer()
{ 
  eraseShip();
  drawExplosion(player_ctr_x, player_ctr_y, 10);
  
  player_lives -= 1;
  if (player_lives < 0)
  {
    drawGameOver();
    return;
  }

  drawHeader();
  startPlayer();
  drawShip(player_ctr_x, player_ctr_y, player_rotation, false);
}

/*
 * Moves player to the next level in the game
 */
void advanceLevel()
{
  changePlayerScore(1000); // level bonus

  for (int i = player_fuel; i >= 0; i--)
  {
    // play tick sound
    //DacAudio.Play(&tick_play);
    changePlayerScore(10);
    //DacAudio.FillBuffer(); 
    changePlayerFuel(-1);
    //DacAudio.FillBuffer(); 
  }
  
  level += 1;
  turret_range += 1;
  loadLevel(level);
  wipeGameArea();
  drawGround();
}


/*
 * Check button presses connected to the shift register
 */
void checkButtonPresses()
{
  bool pressed = false;
  
  digitalWrite(SR_CP, LOW);
  digitalWrite(SR_PL, LOW);
  delay(5);
  digitalWrite(SR_PL, HIGH);

  for(uint8_t i = 0; i < 8; i++)
  {
    btn_was_pressed[i] = btn_pressed[i];  // track previous state
    pressed = (digitalRead(SR_Q7) == LOW ? 1: 0);// read the state of the SO:
    btn_released[i] = !pressed && btn_pressed[i];
    btn_pressed[i] = pressed;
    // Shift the next button pin value into the serial data out
    digitalWrite(SR_CP, LOW);
    delay(1);
    digitalWrite(SR_CP, HIGH);
    delay(1);
    //Serial.print(i); Serial.print(": "); Serial.print(btn_pressed[i]); Serial.print(" - "); Serial.println(btn_released[i]);
  }
}

/*
 * Check the analog joystick values
 */
void checkJoysticks()
{
  // Only use the left 10 bits of the joystick pot readings
  // Center normally ends up around 460
  // May want to use analogReadResolution() at some point to eliminate the need for shifts
  joy_x_left = analogRead(JOYX_L) >> 2;
  joy_y_left = analogRead(JOYY_L) >> 2;
  
  joy_x_right = analogRead(JOYX_R) >> 2;
  joy_y_right = analogRead(JOYY_R) >> 2;
}

float normalizeJoy(int16_t joy_val)
{
  float norm_val = 1;

  // Use center "deadzone" to avoid fluctuations on an inactive stick
  if (joy_val < 450 || joy_val > 475) 
  {
    norm_val = (float)joy_val / 460.0; 
  }
  return norm_val;
}


/*
 * Main program loop
 */
void loop() 
{
  checkButtonPresses();
  checkJoysticks();

  switch(game_state)
  {
    case STATE_TITLE:
      handleTitle(); 
      break;
    case STATE_RULES:
      handleRules();
      break;
    case STATE_PLAYING:
      handlePlaying();
      break;
    case STATE_PAUSED:
      handlePaused(); 
      break;
    case STATE_GAME_OVER:
      handleGameOver(); 
      break;
    
  }

  //DacAudio.FillBuffer(); // load data for any pending audio samples
  delay(level_delay);
}

/*
 * Handles the STATE_TITLE game state logic 
 */
void handleTitle()
{
  if (btn_released[BTN_X])
  {
    drawRulesScreen();
    return;
  }

  if (btn_released[BTN_Y])
  {
    startGame(1);
    return;
  }

  // secret start level hack
  if (btn_pressed[BTN_A])
  {
    //left = bit 0, up = bit 1, down = bit 2, righ = bit 3
    int startLevel = (btn_pressed[BTN_LEFT] ? 1 : 0) + (btn_pressed[BTN_UP] ? 2 : 0) + (btn_pressed[BTN_DOWN] ? 4 : 0) + (btn_pressed[BTN_RIGHT] ? 8 : 0); 
    startGame(startLevel);
  }
}

/*
 * Handles the STATE_RULES game state logic
 */
void handleRules()
{
  if (btn_released[BTN_Y])
  {
    startGame(1);
  }
}

/*
 * Handles the STATE_PLAYING game state logic
 */
void handlePlaying()
{
  // player controls logic
  if (btn_released[BTN_X])
  {
    drawPaused();
    return;
  }
  
  if (btn_pressed[BTN_LEFT])
  {
    player_rotation -= 0.1;
  }

  if (btn_pressed[BTN_RIGHT])
  {
    player_rotation += 0.1;
  }
  
  player_speed_y += gravity;

  if (btn_pressed[BTN_A])
  {
    if (player_fuel > 0)
    {
      player_speed_x += sin(player_rotation + PId2) / 8;
      player_speed_y -= cos(player_rotation + PId2) / 8;
      changePlayerFuel(-1);
    }
  }

  player_ctr_x += player_speed_x;
  player_ctr_y += player_speed_y;

  // screen bounds checking
  if ((player_ctr_x > SCREEN_WD - SHIP_SIZE && player_speed_x > 0) || 
      (player_ctr_x < SHIP_SIZE && player_speed_x < 0))
  {
    player_speed_x = -player_speed_x;
    player_ctr_x += player_speed_x;
  }

  if (((player_ctr_y > (SCREEN_HT - SHIP_SIZE)) && (player_speed_y > 0)) || 
      (player_ctr_y <  20 && (player_speed_y < 0)))
  {
    player_speed_y = -player_speed_y;
    player_ctr_y += player_speed_y;
  }

  if (btn_pressed[BTN_B] && !btn_was_pressed[BTN_B])
  {
    createPlayerShot(player_ctr_x, player_ctr_y, player_rotation);
  }

  // game object hit detection and updates/animation
  drawGround();
  drawFuelPacks();
  drawTurrets(2);
  moveTurretShots();
  if (game_state != STATE_PLAYING)  // in case player died
    return;
    
  if (checkFuelHit(player_ctr_x, player_ctr_y, SHIP_SIZE) >= 0)
  {
    changePlayerScore(200);
    changePlayerFuel(50); 
    fuel_remaining -= 1;
  }

  // check the ship vertices for ground collision
  if (hitsGround(player_ctr_x, player_ctr_y, SHIP_SIZE - 2))
  {
    killPlayer();
    return;
  }

  // check the ship vertices for ground collision
  // this is more accurate, though slower - especially with more ground segments
  /*
  for(int i = 0; i < 4; i++)
  {
    if (hitsGround(ship_x[i], ship_y[i], 1))
    {
      killPlayer();
      return;
    }
  }
  */
  
  
  eraseShip();
  drawShip(player_ctr_x, player_ctr_y, player_rotation, btn_pressed[BTN_A] && player_fuel > 0);

  movePlayerShots();

  if (turret_remaining == 0 && fuel_remaining == 0)
  {
    advanceLevel();
  }
}

/*
 * Handles the STATE_PAUSED game state logic
 */
void handlePaused()
{
  if (btn_released[BTN_X])
  {
   erasePaused();
  }
}

/*
 * Handles the STATE_GAME_OVER game state logic
 */
void handleGameOver()
{
  if (btn_released[BTN_Y])
  {
    drawTitleScreen();
  }
}